package com.company.item.protectiveGear;

/** 갑옷의 이름을 나열한 클래스입니다.
 * [갑옷 리스트]
 * 갑옷 이름        요구레벨        갑옷 가격             특수효과
 * 기본옷           1             0(기본무기)             x
 * 혈웅복           5             400                  질긴갑옷
 * 월령복           10            800                  강철갑옷
 * 금강복           15            1200                 금강
 * 천석복           20            2000                 가시갑옷
 * 멸살복           25            3000                 신의가호
 * */
public enum ProtectiveGearNames {
    기본옷, 혈웅복, 월령복, 금강복, 천석복, 멸살복
}
